InformationRegisters/ТК_ДатыОстатковOS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТК_ДатыОстатковOS</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПолнойВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТК_ДатыОстатковOS/Ext/ManagerModule.bsl
Процедура ЗаписатьНовуюДату(Дата,СкладКомпании) Экспорт
	
	НаборЗаписей = РегистрыСведений.ТК_ДатыОстатковOS.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СкладКомпании.Установить(СкладКомпании);
   	НоваяСтрокаНабора = НаборЗаписей.Добавить();
	НоваяСтрокаНабора.СкладКомпании = СкладКомпании;
	НоваяСтрокаНабора.Дата = Дата;
	
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Записать();
	
КонецПроцедуры
